Revit 2018 API
AssetProperties.Size Property
Gets the number of the AssetProperty(s) in the object.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public int Size { get; }
Visual Basic
Public ReadOnly Property Size As Integer
	Get
Visual C++
public:
property int Size {
	int get ();
}
See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace